In [1]:
import pandas as pd

In [5]:
d=pd.read_csv(r"C:\Users\Tcs\Downloads\employees1.csv")
print(d)

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]

In [7]:
d.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [8]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [11]:
print(d.shape)

(1000, 8)

In [13]:
print(d['Gender'])

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
995       NaN
996      Male
997      Male
998      Male
999      Male
Name: Gender, Length: 1000, dtype: object

In [14]:
print(d['Last Login Time'])

0      12:42 PM
1       6:53 AM
2      11:17 AM
3       1:00 PM
4       4:47 PM
         ...
995     6:09 AM
996     6:30 AM
997    12:39 PM
998     4:45 PM
999     6:24 PM
Name: Last Login Time, Length: 1000, dtype: object

In [15]:
print(d[991:999])

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
991       Rose  Female   8/25/2002         5:12 AM  134505   11.051
992    Anthony    Male  10/16/2011         8:35 AM  112769   11.625
993       Tina  Female   5/15/1997         3:53 PM   56450   19.040
994     George    Male   6/21/2013         5:47 PM   98874    4.479
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985

    Senior Management                  Team
991              True             Marketing
992              True               Finance
993              True           Engineering
994              True             Marketing
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development

In [18]:
print(d.loc[d['Salary']>120000])

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
9      Frances  Female    8/8/2002         6:51 AM  139852    7.524
18       Diana  Female  10/23/1981        10:27 AM  132940   19.082
23         NaN    Male   6/14/2012         4:19 PM  125792    5.042
..         ...     ...         ...             ...     ...      ...
983       John    Male  12/23/1982        10:35 PM  146907   11.738
987     Gloria  Female   12/8/2014         5:08 AM  136709   10.331
991       Rose  Female   8/25/2002         5:12 AM  134505   11.051
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
2               False               Finance
3                True               Finance
9                True  Business Development
18              False       Client Services
23                NaN                   NaN
..                ...                   ...
983             False           Engineering
987              True               Finance
991              True             Marketing
995             False          Distribution
999              True                 Sales

[241 rows x 8 columns]

In [19]:
print(d.loc[234])

First Name                     Irene
Gender                        Female
Start Date                  2/4/1982
Last Login Time              5:26 PM
Salary                         40837
Bonus %                       12.182
Senior Management               True
Team                 Client Services
Name: 234, dtype: object

In [20]:
print(d.loc[d['Senior Management']==True])

    First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
6         Ruby  Female   8/17/1987         4:20 PM   65476   10.012
..         ...     ...         ...             ...     ...      ...
991       Rose  Female   8/25/2002         5:12 AM  134505   11.051
992    Anthony    Male  10/16/2011         8:35 AM  112769   11.625
993       Tina  Female   5/15/1997         3:53 PM   56450   19.040
994     George    Male   6/21/2013         5:47 PM   98874    4.479
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management             Team
0                True        Marketing
1                True              NaN
3                True          Finance
4                True  Client Services
6                True          Product
..                ...              ...
991              True        Marketing
992              True          Finance
993              True      Engineering
994              True        Marketing
999              True            Sales

[468 rows x 8 columns]